import React from "react";

import "./style.scss";
function ForBusiness() {
	return (
		<section className="business">
			<p>
				Чи часто Ви замислювалися, як здивувати партнерів по бізнесу, привітати
				колег, відзначити кращих не класичним подарунком, а чимось цікавим і
				незабутнім?
				<p>
					<span>
						Якісні наручні годинники з логотипом стануть прекрасним рішенням!
					</span>{" "}
				</p>
			</p>
			<p>
				Наша компанія займається розробкою і створенням наручних годинників як
				для продажу в роздріб, так і створюємо брендовані годинники для
				корпоративних компаній. За шість років роботи нами було здійснено більше
				600 проєктів, в тому числі ми співпрацювали з такими компаніями як:
				Wargaming, Альфа-Банк, Onliner, Авіаремонтний завод та ін. Клієнти
				користуються нашими послугами, щоб заохотити співробітників або зробити
				подарунок партнерам.
			</p>
			<p>
			<span>	Для Вас ми із задоволенням розробимо годинник з Вашим логотипом і
				підберемо цікаві рішення під будь-який обсяг і бюджет в нашому каталозі.</span>
			</p>
			<p>
				<ol>
					Переваги роботи з нами:
					<li>Спеціальні умови покупки: програма лояльності і знижок;</li>
					<li>
						Простота і ефективність комунікації: персональні менеджери з
						корпоративних продажів і сервісу нададуть професійне консультування
						та підбір оптимального рішення;
					</li>
					<li>
						По-справжньому індивідуальний підхід: розробка унікального дизайну і
						технічних характеристик виходячи з побажань і переваг клієнта;
					</li>
					<li>
						{" "}
						Працюємо в термін: цінуємо час клієнта і дорожимо своєю репутацією;
					</li>
					<li>
						Гарантія: високі стандарти виробництва і менеджменту якості. Будемо
						раді співпраці!
					</li>
				</ol>
			</p>
      
    <h3>Звязатись з нами:</h3>
    <p>Пошта: matoa@com.ua</p>
    <p>Номер телефону: +380 68 888 770</p>
		</section>
	);
}

export default ForBusiness;
