import React, { useState, useEffect } from "react";
import Feedback from "../../Feedbacks/Feedback";
import { useSelector } from "react-redux";
import { useDispatch } from "react-redux";
import { createStructuredSelector } from "reselect";
import { getUserOrderHistory } from "../../../redux/Orders/orders.actions";
import { selectOrderItems } from "../../../utils/utils";
import "./details.scss";
const mapState = ({ ordersData, user }) => ({
	orders: ordersData.ordersHistory.data,
	currentUser: user.currentUser,
});
const mapStateSelector = createStructuredSelector({
	dataOrders: selectOrderItems,
});

const ProductDetails = (product) => {
	const dispatch = useDispatch();
	const { productDesc, documentId } = product;
	const { dataOrders } = useSelector(mapStateSelector);
	const { orders, currentUser } = useSelector(mapState);
	const { id } = currentUser || [];
	const [allow, setAllow] = useState(false);
	const [active, setActive] = useState(0);
	const [stateStyle, setstateStyle] = useState({ fade: false });
	const [state, setstate] = useState();

	const handleAllow = () => {
		if (Array.isArray(dataOrders) && dataOrders.length > 0) {
			const items = dataOrders.map((data) => {
				return data.orderItems.map((data) => {
					return data.documentId;
				});
			});
			const arrItems = [].concat.apply([], items);

			setAllow(arrItems.includes(documentId));
		}
	};
	useEffect(() => {
		setstate();
		handleAllow();
		dispatch(getUserOrderHistory(id));
	}, [allow, active]);
	console.log(allow);
	const details = [
		"Деталі",
		"Гарантія",
		"Відгуки",
		"Як налаштовувати",
		"Догляд",
	];
	const configFeedback = {
		currentUser,
		product,
		allow,
	};
	const detailsRender = [
		productDesc,
		"<h2>Гарантійні зобов'язання </h2><p>Термін гарантійного обслуговування 12 місяців, протягом яких проводиться безкоштовний ремонт.</p><p>Гарантійний ремонт здійснюється за наявності паспорта.</p> <ul>ГАРАНТІЯ не поширюється:<li>на годинник, в стані не гарантійного обслуговування;</li><li>у випадках, якщо дефект годинника виник внаслідок порушення інструкції по експлуатації;</li><li>на елемент живлення;</li><li>на ремені і браслети;</li><li>на скло.</li></ul>",
		<Feedback {...configFeedback} />,
		"<h2>Як налаштовувати?</h2> <p>1. Знайдіть важіль (ручку, коліщатко) для регулювання Зазвичай цей важіль знаходиться збоку корпусу годинника, </p><p>2. Приведення важеля у стан регулювання. Для цього необхідно двома нігтями підхопити важіль у основи і потягнути убік від корпусу годинника, як це показано стрілочкою на малюнку зліва. Зазвичай це супроводжується характерним клацанням, що означає, що важіль відклався і готовий до регулювання стрілок годинника. При цьому всі стрілки годинника зупиняються, а між корпусом годинника і важелем регулювання з'являється невеликий проміжок.</p><p>3. Регулювання, налаштування, виставлення необхідного часу.Для цього потрібно просто повертаючи важіль налаштування або в одну або в іншу сторону виставити хвилинну та годинну стрілки на потрібний час.</p> <p>4. Завершення налаштування, останній крокІ останній крок - це фіксація виставленого часу і запуск годинника.Для цього потрібно просто натиснути пальцем на важіль регулювання у бік корпусу годинника. В результаті відбувається невелике клацання, </p>",
		"<h2>Доглядаємо за механізмом</h2><p> Для кварцових годинників існує кілька правил, порушивши які можна істотно погіршити роботу аксесуара. Якщо періодично або постійно піддавати їх електромагнітному випромінюванню, то хронометр буде давати збої в роботі, почно відставати або прискорювати хід. Такий же результат можна отримати, якщо піддавати годинник сильному нагріванню.Механічний годинник вимагають дбайливого звернення в першу чергу з точки зору використання їх в чистоті. Пот, що виділяється тілом, змішується з пилом і брудом з навколишнього середовища і проникає в механізм, пошкоджуючи його. Тому годинник необхідно акуратно періодично протирати вологою тканиною.Водостійкі - можна промивати в теплій мильній воді, використовуючи м'яку зубну щітку. Потім виріб необхідно сполоснути проточною водою. Для чищення браслета можна використовувати ті ж методи.</p><h2>Доглядаємо за ремінцем і браслетом годинника </h2> <p> Ремінці з каучуку, текстилю і шкіри не люблять зайвої вологи і високих температур. Текстиль взагалі може отримати порушення цілісності структури. Ремінці зі шкіри необхідно для блиску і еластичності протирати розчинами, спеціально для цього призначеними.Шкіряні ремінці не можна занадто мочити, тому що натуральний матеріал може потріскатися і розсохтися. Таким же чином слід доглядати за виробами з каучуку. Після будь-якого контакту з водою, подібні ремінці необхідно протирати насухо м'якою тканиною.Браслети можна промивати під проточною водою. Це дасть можливість позбавити їх від поту, бруду і пилу. Якщо браслет побував у воді солоної або з додаванням хлору, його обов'язково необхідно потім обполоснути звичайною водою з-під крана.Полірування браслету можна зробити самостійно за допомогою пасти ГОІ чи здавши спеціальну майстерню.</p><h2>Догляд за склом наручного годинника</h2>Поверхня захисного скла також вимагає дбайливого звернення. Якщо годинник впустити на тверду поверхню, розбити можна навіть найміцніше сапфірове скло. У такому випадку його необхідно терміново замінити. Якщо на склі виникли тріщини, відколи й глибокі подряпини - діяти потрібно в такий же спосіб. В іншому випадку в механізм можуть потрапити непотрібні частинки і бруд.Для уникнення подряпин, незалежно від того, який у Вас тип скла, виключайте контакт годин з поверхнею столу, запонками, гострими предметами. При попаданні пилу і вологи на скло - протирайте його м'якою тканиною, не втираючи її в скло. Для сапфірових стекол скористайтеся для чищення-поліруючим засобом, купленим в спеціалізованому магазині.</h2>",
	];

	const handleActive = (index) => {
		setActive(index);
		setstateStyle({ fade: true });
		handleAllow();
	};

	return (
		<section className="details">
			<div className="container">
				<div className="row">
					<div className="wrapper-details">
						<div className="header-details">
							<ul className="header-details__list">
								{details.map((text, index) => {
									return (
										<li
											className={
												active === index ? "nav-link active" : "nav-link"
											}
											onClick={() => handleActive(index)}
										>
											{text}
										</li>
									);
								})}
							</ul>
						</div>
						<div
							onAnimationEnd={() => setstateStyle({ fade: false })}
							className={
								stateStyle.fade ? "imgAnimate header-info" : "header-info"
							}
						>
							{active === 2 ? (
								<Feedback {...configFeedback} />
							) : (
								<div
									dangerouslySetInnerHTML={{ __html: detailsRender[active] }}
								/>
							)}
						</div>
					</div>
				</div>
			</div>
		</section>
	);
};

export default ProductDetails;
